#### IFCGeometryInfo Members

---

|  |
| --- |
| IFCGeometryInfo Class   Methods   Properties   See Also |

The  IFCGeometryInfo  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateCurveGeometryInfo | Creates a new container object which holds IfcCurve handles processed from a Revit geometry object. |
| Public method Static member | CreateFaceGeometryInfo(Double) | Creates a new container object which holds IfcFace handles processed from a Revit geometry object. |
| Public method Static member | CreateFaceGeometryInfo(Double, Boolean) | Creates a new container object which holds IfcFace handles processed from a Revit geometry object. |
| Public method Static member | CreateFaceGeometryInfo(ExporterIFC, Plane, XYZ, Double, Boolean) | Creates a new container object which holds IfcFace handles processed from a Revit geometry object. |
| Public method Static member | CreateSurfaceGeometryInfo | Creates a new container object which holds IfcSurface handles processed from a Revit geometry object. |
| Public method | Dispose | Releases all resources used by the  IFCGeometryInfo |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetCurves | Gets the IfcCurve handles created representing the processed geometry and stored in this object. |
| Public method | GetFaces | Gets the IfcFace handles created representing the processed geometry and stored in this object. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetRepresentations | Gets the representation handles created representing the processed geometry and stored in this object. |
| Public method | GetSurfaces | Gets the IfcSurface handles created representing the processed geometry and stored in this object. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

IFCGeometryInfo Class

Autodesk.Revit.DB.IFC Namespace